# Panda data frames

In [2]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [3]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

### Selecting all names and associated states

In [4]:
df.loc[:, ['name', 'state']]

    name       state
0   john        iowa
1   mary          dc
2  peter  california
3   jeff       texas
4   bill  washington
5   lisa          dc

### Select entirety of first 2 rows

In [5]:
df.loc[:2]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

In [6]:
# Select last 2 rows
# [0] casts as a dataframe 
df.iloc[-2:, [0]]

   name
4  bill
5  lisa


## df.iloc is exclusive, takes the index instead of str
## df.loc is inclusive

### Selecting the first column without specifying the name of column

In [7]:
df.iloc[:,[0]]

    name
0   john
1   mary
2  peter
3   jeff
4   bill
5   lisa

### Selecting second row of data frame

df.iloc[[1]]

## CONDITIONALS 
### age > 30

In [8]:
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

### pets > children

In [12]:
df[df["num_pets"] > df["num_children"]]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

## multi-conditions
###  older than 40 & own pets

In [9]:
df[ (df["age"] > 40) & (df["num_pets"] > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

## Oldear than 40 OR has pets

In [11]:
df[ (df["age"] > 40) | (df["num_pets"] > 0)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

## Drop columns (data itself not manipulated, shallow copy created)
### Drop age and num_children columns

In [14]:
df.drop(["age",'num_children'],axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

## Calculations
### Average for age, num_pets and num_children

In [17]:
# Apply aggregate function to every column
# MEAN
import numpy as np
df[["age","num_pets","num_children"]].apply(lambda col: np.mean(col),axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [18]:
# SUM
df[["age","num_pets","num_children"]].apply(lambda col: np.sum(col),axis=0)

age             220
num_pets          9
num_children      8
dtype: int64

In [19]:
df['num_children'].sum()

8

In [20]:
df.sum()

name                    johnmarypeterjeffbilllisa
age                                           220
state           iowadccaliforniatexaswashingtondc
num_children                                    8
num_pets                                        9
dtype: object

### add numerical values of rows (add age, num_pets, num_children)

In [22]:
df[["age","num_pets","num_children"]].apply(lambda row: np.sum(row),axis=1)

0    25
1    84
2    22
3    25
4    47
5    34
dtype: int64

### Describe(stats)

In [15]:
df.describe()

# ! NOTE - only works with ints/floats. Will not work with strs.
# refer to docs for strs - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

### Select dataframe based on column name

In [17]:
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

### Apply a function to a specific column(does not manipulate dataframe)

In [20]:
df[['age']].apply(lambda age:age*3)

   age
0   69
1  234
2   66
3   57
4  135
5   99

## Apply a function to a specific column and CHANGE dataframe

In [21]:
df['age'] = df['age'].apply(lambda age:age+2)

In [28]:
df

    name  age       state  num_children  num_pets
0   john   25        iowa             2         0
1   mary   80          dc             2         4
2  peter   24  california             0         0
3   jeff   21       texas             1         5
4   bill   47  washington             2         0
5   lisa   35          dc             1         0

In [27]:
df['new_column'] = df['age']*df['num_children']

In [28]:
df

    name  age       state  num_children  num_pets  new_column
0   john   25        iowa             2         0          50
1   mary   80          dc             2         4         160
2  peter   24  california             0         0           0
3   jeff   21       texas             1         5          21
4   bill   47  washington             2         0          94
5   lisa   35          dc             1         0          35

### Sort dataframe on a column in ascending order

In [29]:
# Ascending order for age
df.sort_values('age', ascending=True)

    name  age       state  num_children  num_pets
3   jeff   21       texas             1         5
2  peter   24  california             0         0
0   john   25        iowa             2         0
5   lisa   35          dc             1         0
4   bill   47  washington             2         0
1   mary   80          dc             2         4

### Select rows whose name begins with letter 'j'

In [30]:
df[df.apply(lambda row: row['name'].startswith('j'), axis=1)]

   name  age  state  num_children  num_pets
0  john   25   iowa             2         0
3  jeff   21  texas             1         5

## A quick way to create dummy data

In [34]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
p = d.pivot(index='Item', columns='CType', values='USD')

In [35]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [31]:
p = d.pivot(index='Item', columns='CType', values='USD')
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$